"use client";
import { Button } from "@/components/ui/button";
import { useRouter } from "next/navigation";

export default function NotFound() {
  const router = useRouter();
  return (
    <div className="bg-background justify-center items-center h-screen mx-8 flex flex-col-reverse lg:flex-row">
      <div>
        <h2 className="scroll-m-20 pb-2 text-3xl font-semibold tracking-tight first:mt-0">
          A página que você está tentando acessar provavelmente foi alterada ou
          removida.
        </h2>
        <Button
          type="button"
          className="mt-4"
          onClick={() => {
            router.back();
          }}
        >
          Voltar
        </Button>
      </div>
      <svg
        width={350}
        height={382}
        viewBox="0 0 400 382"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path fill="url(#paint0_radial_22_900)" d="M0 0H400V381.609H0z" />
        <g fill="#846666">
          <path d="M166.283 233.716l-8.429-6.13-1.532 46.743 7.663 2.299 2.298-42.912zM226.054 254.406l-23.755 35.249 8.429 3.065 27.586-38.314h-12.26z" />
        </g>
        <circle cx={230.651} cy={143.295} r={111.111} fill="#685ED9" />
        <path
          d="M150.933 276.706l62.504 20.533-10.712 32.608c-3.434 10.453-14.692 16.144-25.146 12.71l-24.648-8.097c-10.453-3.434-16.144-14.692-12.71-25.146l10.712-32.608z"
          fill="#C0ACA8"
        />
        <rect
          x={150.881}
          y={271.514}
          width={69.5838}
          height={9.59119}
          rx={1.53257}
          transform="rotate(18.186 150.881 271.514)"
          fill="#9B7979"
        />
        <g>
          <path
            d="M308.812 224.64c-26.973-5.517-39.336 16.092-42.145 27.587-3.321-4.343-13.487-12.261-27.586-9.196-14.1 3.065-18.136 18.646-18.391 26.053 0 0-5.684-.752-9.196 0-1.85.397-4.597 1.533-4.597 1.533s-2.555.766-5.364 3.065c-2.399 1.963-6.847 7.613-8.096 16.092.655 4.598 6.257 13.793 23.421 13.793H339.886c5.223-.255 16.129-3.831 17.968-16.092-4.291-15.938-18.646-17.369-25.287-16.092 3.321-13.282 3.219-41.225-23.755-46.743z"
            fill="#F9F9F9"
          />
          <path
            d="M341.763 312.763c7.151-1.788 20.383-9.349 16.091-25.288-1.839 12.261-12.745 15.837-17.968 16.092H216.858c-17.164 0-22.766-9.195-23.421-13.793a31.63 31.63 0 00-.333 4.598c0 11.034 9.706 16.858 14.559 18.391h134.1z"
            fill="#DAD5D5"
          />
        </g>
        <g>
          <path
            d="M155.555 143.414c-26.973-5.517-39.335 16.092-42.145 27.586-3.321-4.342-13.487-12.26-27.586-9.195-14.1 3.065-18.136 18.646-18.391 26.053 0 0-5.684-.752-9.196 0-1.85.397-4.597 1.533-4.597 1.533s-2.554.766-5.364 3.065c-2.4 1.963-6.847 7.613-8.096 16.092.655 4.598 6.257 13.793 23.422 13.793h123.027c5.224-.255 16.13-3.831 17.969-16.092-4.292-15.938-18.647-17.369-25.288-16.092 3.321-13.282 3.219-41.226-23.755-46.743z"
            fill="#F9F9F9"
          />
          <path
            d="M188.506 231.537c7.152-1.788 20.383-9.349 16.092-25.288-1.839 12.261-12.745 15.837-17.969 16.092H63.601c-17.164 0-22.766-9.195-23.42-13.793a31.53 31.53 0 00-.334 4.598c0 11.034 9.706 16.858 14.56 18.391h134.099z"
            fill="#DAD5D5"
          />
        </g>
        <defs>
          <radialGradient
            id="paint0_radial_22_900"
            cx={0}
            cy={0}
            r={1}
            gradientUnits="userSpaceOnUse"
            gradientTransform="matrix(0 190.805 -200 0 200 190.805)"
          >
            <stop stopOpacity={0.9} />
            <stop offset={1} stopColor="#fff" stopOpacity={0} />
          </radialGradient>
        </defs>
      </svg>
    </div>
  );
}
